---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RenderingSettings
source: html/f7cc505f-1a17-881e-7859-adc21fb8d6e4.htm
---
# RenderingSettings Members

Releases all resources used by the RenderingSettings